{
  "module": {
    "description": "La solution de paiement française à impact positif sur la société et l'environnement",
    "form": {
      "buttons": {
        "validate": "Valider",
        "delete": "Effacer",
        "cancel": "Annuler"
      }
    }
  },
  "backoffice": {
    "errors": {
      "connection": "Erreur durant la gestion de votre connexion.",
      "interface_global": "Erreur durant la préparation du backoffice Paygreen.",
      "processing": "Une erreur est survenue durant la résolution de votre demande.",
      "interface_construction": "Erreur durant la génération de l'interface de configuration.",
      "authentication_required": "Cette section requiert que vous soyez connecté sur votre compte Paygreen."
    },
    "actions": {
      "hooks": {
        "result": {
          "success": "Les Hooks ont bien été replacés en première position.",
          "failure": "La modification de la position des Hooks a échoués."
        },
        "errors": {
          "display_form": "Une erreur s'est produite lors de la création du formulaire de configuration des Hooks."
        }
      },
      "credentials": {
        "save": {
          "result": {
            "success": "Vos identifiants de connexion ont été sauvegardés avec succès.",
            "failure": "Une erreur s'est produite lors de la sauvegarde de vos identifiants de connexion !"
          }
        },
        "reset": {
          "result": {
            "success": "Vos identifiants de connexion ont été réinitialisés avec succès.",
            "failure": "Une erreur s'est produite lors de la réinitialisation de vos identifiants de connexion !"
          }
        }
      },
      "testmode": {
        "toggle": {
          "result": {
            "success": "Le mode test a été modifié avec succès.",
            "failure": "Une erreur s'est produite lors de la modification du mode test !"
          }
        }
      }
    }
  },
  "account": {
    "actions": {
      "toggle": {
        "result": {
          "success": "L'activation du compte a été mise à jour avec succès.",
          "failure": "Une erreur s'est produite lors de la mise à jour de l'activation du compte."
        }
      }
    },
    "backoffice": {
      "errors": {
        "header": "Une erreur s'est produite lors de la création de l'en-tête de l'interface de configuration."
      }
    },
    "errors": {
      "account_not_found": "Impossible de se connecter à votre compte Paygreen.",
      "invalid_public_key": "Votre clé privée n'est pas valide.",
      "invalid_private_key": "Votre clé publique n'est pas valide.",
      "empty_bank_data": "Vos données bancaires sont incomplètes.",
      "empty_shop_data": "Les données de votre boutique sont incomplètes."
    }
  },
  "eligible_amounts": {
    "actions": {
      "save_category_payments": {
        "title": "Activation des moyens de paiement par catégorie",
        "result": {
          "success": "Configuration des catégories de paiement enregistrée avec succès."
        },
        "errors": {
          "display_form": "Une erreur s'est produite lors de la création du formulaire de configuration des catégories de paiement."
        },
        "header": [
          "Activez vos moyens de paiement en fonction de la catégorie des produits ajoutés au panier.",
          "Exemple : Vous pouvez n'activer les TRD que pour les catégories contenant exclusivement des produits alimentaires éligibles."
        ],
        "footer": [
          "Si vous ne cochez aucune case dans une colonne, cela signifie que toutes les catégories sont éligibles pour ce moyen de paiement.",
          "Un bouton de paiement ne pourra être utilisé pour une commande donnée que si au moins un produit de la commande est éligible.",
          "Pour une commande contenant également des produits non-éligibles, un complément sera automatiquement demandé en carte bleue."
        ]
      },
      "save_shipping_payments": {
        "title": "Gestion des frais de livraison par moyen de paiement",
        "result": {
          "success": "La configuration de l'exclusion des modes d'expédition a été enregistrée avec succès."
        },
        "errors": {
          "display_form": "Une erreur s'est produite lors de la création du formulaire d'exclusion des modes d'expédition."
        },
        "header": [
          "Si la livraison ne peut pas être payée par un moyen de paiement, cochez la case correspondante à celui-ci.",
          "Par exemple, cochez TRD pour faire en sorte que ce moyen de paiement ne soit pas utilisé pour les frais de livraison."
        ],
        "footer": [
          "Par défaut, les frais de livraison sont éligibles pour tous les moyens de paiement.",
          "Cocher les cases ci-dessus revient donc à les exclure d'un moyen de paiement.",
          "Si les frais de port sont exclus d'un moyen de paiement, alors un complément en carte bancaire sera demandé à votre client."
        ]
      }
    }
  },
  "system": {
    "title": "Informations systèmes sur le module Paygreen",
    "platform": {
      "title": "Plateforme d'execution",
      "fields": {
        "platform": "Plateforme",
        "php": "PHP",
        "module": "Module Paygreen",
        "framework": "Framework Paygreen",
        "curl": "Version de cURL",
        "ssl": "Version de OpenSSL"
      }
    },
    "logs": {
      "title": "Fichiers de log",
      "columns": {
        "filename": "Nom du fichier",
        "size": "Taille",
        "last_update": "Dernière modification"
      },
      "actions": {
        "delete": {
          "button": "Effacer",
          "success": "Le fichier ciblé a bien été effacé."
        },
        "download": {
          "button": "Télécharger"
        }
      },
      "errors": {
        "invalid_file": "Le fichier ciblé n'est pas un fichier de log valide.",
        "file_not_found": "Le fichier ciblé n'existe pas."
      }
    }
  }
}